{"class_name": "Model", "keras_version": "1.2.0", "config": {"name": "model_1", "input_layers": [["image_input", 0, 0]], "layers": [{"name": "image_input", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 3], "name": "image_input", "sparse": false, "input_dtype": "float32"}}, {"name": "convolution2d_1", "inbound_nodes": [[["image_input", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_filter": 3, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "nb_col": 1, "trainable": true, "nb_row": 1, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "bias": true, "name": "convolution2d_1", "activation": "linear", "border_mode": "valid", "b_constraint": null, "subsample": [1, 1]}}, {"name": "convolution2d_2", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_filter": 32, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "nb_row": 3, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "bias": true, "name": "convolution2d_2", "activation": "linear", "border_mode": "valid", "b_constraint": null, "subsample": [1, 1]}}, {"name": "elu_1", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"name": "maxpooling2d_1", "inbound_nodes": [[["elu_1", 0, 0]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"name": "dropout_1", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"name": "convolution2d_3", "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_filter": 64, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "nb_row": 3, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "bias": true, "name": "convolution2d_3", "activation": "linear", "border_mode": "valid", "b_constraint": null, "subsample": [1, 1]}}, {"name": "elu_2", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"name": "activation_1", "inbound_nodes": [[["elu_2", 0, 0]]], "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"name": "maxpooling2d_2", "inbound_nodes": [[["activation_1", 0, 0]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"name": "dropout_2", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"name": "convolution2d_4", "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Convolution2D", "config": {"nb_filter": 128, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "trainable": true, "nb_row": 3, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "bias": true, "name": "convolution2d_4", "activation": "linear", "border_mode": "valid", "b_constraint": null, "subsample": [1, 1]}}, {"name": "elu_3", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"name": "maxpooling2d_3", "inbound_nodes": [[["elu_3", 0, 0]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"name": "dropout_3", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"name": "flatten_1", "inbound_nodes": [[["dropout_3", 0, 0]]], "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense", "config": {"output_dim": 512, "activity_regularizer": null, "name": "dense_1", "input_dim": 4608, "activation": "linear", "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "bias": true, "W_regularizer": null, "b_constraint": null}}, {"name": "elu_4", "inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"name": "dropout_4", "inbound_nodes": [[["elu_4", 0, 0]]], "class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"name": "dense_2", "inbound_nodes": [[["dropout_4", 0, 0]]], "class_name": "Dense", "config": {"output_dim": 64, "activity_regularizer": null, "name": "dense_2", "input_dim": 512, "activation": "linear", "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "bias": true, "W_regularizer": null, "b_constraint": null}}, {"name": "elu_5", "inbound_nodes": [[["dense_2", 0, 0]]], "class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"name": "dropout_5", "inbound_nodes": [[["elu_5", 0, 0]]], "class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_5", "trainable": true}}, {"name": "dense_3", "inbound_nodes": [[["dropout_5", 0, 0]]], "class_name": "Dense", "config": {"output_dim": 16, "activity_regularizer": null, "name": "dense_3", "input_dim": 64, "activation": "linear", "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "bias": true, "W_regularizer": null, "b_constraint": null}}, {"name": "elu_6", "inbound_nodes": [[["dense_3", 0, 0]]], "class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"name": "dropout_6", "inbound_nodes": [[["elu_6", 0, 0]]], "class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_6", "trainable": true}}, {"name": "steering", "inbound_nodes": [[["dropout_6", 0, 0]]], "class_name": "Dense", "config": {"output_dim": 1, "activity_regularizer": null, "name": "steering", "input_dim": 16, "activation": "linear", "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "b_constraint": null}}, {"name": "throttle", "inbound_nodes": [[["dropout_6", 0, 0]]], "class_name": "Dense", "config": {"output_dim": 1, "activity_regularizer": null, "name": "throttle", "input_dim": 16, "activation": "linear", "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "b_constraint": null}}], "output_layers": [["steering", 0, 0], ["throttle", 0, 0]]}}